Tesis/Graficos/tS-actuationDiskRingsV11-4/openfoam-backup-main/tS-actuationDiskRingsV11-3/0.orig/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

#include        "include/initialConditions"

internalField   uniform $TEpsilon;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $TEpsilon;
        value           $internalField;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant $TEpsilon;
    }

    terrain
    {
        type            slip;
    }

    ground
    {
        type            slip;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
