Tesis/Graficos/tS-actuationDiskRingsV11-4/openfoam-backup-main/tS-actuationDiskRingsV11-3/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $TKE;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform $TKE;
        value           $internalField;
    }

    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       $TI;       // 5% turbulent intensity
        value           $internalField;
    }

    terrain
    {
        type            slip;
    }

    ground
    {
        type            slip;
    }

    #include "include/sideAndTopPatches"
}


// ************************************************************************* //
