Tesis/Graficos/tS-actuationDiskRingsV11-4/openfoam-backup-main/tS-actuationDiskRingsV11-3/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------
python3 includeSettings.py

restore0Dir

runApplication blockMesh

runApplication decomposePar

runParallel snappyHexMesh -overwrite

find . -iname '*level*' -type f -delete

# Set the initial fields
restore0Dir -processor

runParallel topoSet

runParallel $(getApplication)

runApplication reconstructParMesh -constant

runApplication reconstructPar

## runApplication setExprFields -latestTime  ## -load-fields U

## runApplication setExprBoundaryFields -latestTime  ## -load-fields '(U)'

bash ./postProcess.sh

#------------------------------------------------------------------------------
