Tesis/Graficos/tS-actuationDiskRingsV11-4/openfoam-backup-main/tS-actuationDiskRingsV11-3/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type            sets;
libs            (sampling);
interpolationScheme cellPoint;
setFormat       csv;
fields          ( U );

sets
(
    D1
    {
        type            uniform;
        axis            y;
        start           (600 0 450);
        end             (600 900 450);
        nPoints         1000;
    }

    D2
    {
        type            uniform;
        axis            y;
        start           (700 0 450);
        end             (700 900 450);
        nPoints         1000;
    }

    D4
    {
        type            uniform;
        axis            y;
        start           (900 0 450);
        end             (900 900 450);
        nPoints         1000;
    }

    D6
    {
        type            uniform;
        axis            y;
        start           (1100 0 450);
        end             (1100 900 450);
        nPoints         1000;
    }

    D8
    {
        type            uniform;
        axis            y;
        start           (1300 0 450);
        end             (1300 900 450);
        nPoints         1000;
    }

    D10
    {
        type            uniform;
        axis            y;
        start           (1500 0 450);
        end             (1500 900 450);
        nPoints         1000;
    }

    D12
    {
        type            uniform;
        axis            y;
        start           (1700 0 450);
        end             (1700 900 450);
        nPoints         1000;
    }

    D15
    {
        type            uniform;
        axis            y;
        start           (2000 0 450);
        end             (2000 900 450);
        nPoints         1000;
    }
);


// ************************************************************************* //
